------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.conversion-tool.aws_ecs_cluster.conversion-tool-ecs-cluster will be updated in-place
  ~ resource "aws_ecs_cluster" "conversion-tool-ecs-cluster" {
        arn                = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-impl"
        capacity_providers = []
        id                 = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-impl"
        name               = "qppsf-conversion-tool-impl"
        tags               = {
            "Name"            = "qppsf-ct-ecr-impl"
            "application"     = "ConversionTool"
            "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
            "owner"           = "qppar-final-scoring"
            "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
            "project"         = "qppsf-ct"
            "sensitivity"     = "PII/PHI"
            "terraform"       = "true"
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.conversion-tool.aws_ecs_service.conversion-tool-service must be replaced
-/+ resource "aws_ecs_service" "conversion-tool-service" {
        cluster                            = "arn:aws:ecs:us-east-1:003384571330:cluster/qppsf-conversion-tool-impl"
        deployment_maximum_percent         = 100
        deployment_minimum_healthy_percent = 0
        desired_count                      = 1
        enable_ecs_managed_tags            = false
      - health_check_grace_period_seconds  = 0 -> null
      ~ iam_role                           = "aws-service-role" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:us-east-1:003384571330:service/qppsf-conversion-tool-impl/conversion-tool-service-impl" -> (known after apply)
        launch_type                        = "FARGATE"
        name                               = "conversion-tool-service-impl"
        platform_version                   = "1.4.0"
      - propagate_tags                     = "NONE" -> null
        scheduling_strategy                = "REPLICA"
        tags                               = {
            "Name"            = "qppsf-ct-ecr-impl"
            "application"     = "ConversionTool"
            "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
            "owner"           = "qppar-final-scoring"
            "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
            "project"         = "qppsf-ct"
            "sensitivity"     = "PII/PHI"
            "terraform"       = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:003384571330:task-definition/qppsf-conversion-tool-td-impl:7" -> (known after apply)

      - deployment_controller {
          - type = "ECS" -> null
        }

        load_balancer {
            container_name   = "conversion-tool"
            container_port   = 8080
            target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:targetgroup/conversion-tg-impl/d881eb07c7d56683"
        }
      + load_balancer { # forces replacement
          + container_name   = "conversion-tool"
          + container_port   = 8443
          + target_group_arn = (known after apply)
        }

        network_configuration {
            assign_public_ip = false
            security_groups  = [
                "sg-013c1f26005939b02",
                "sg-04460af49075eec77",
                "sg-15086661",
                "sg-3cc0b34d",
            ]
            subnets          = [
                "subnet-0f21a355",
                "subnet-31957055",
                "subnet-bd3f72f5",
            ]
        }

      + placement_strategy {
          + field = (known after apply)
          + type  = (known after apply)
        }
    }

  # module.conversion-tool.aws_ecs_task_definition.conversion-tool must be replaced
-/+ resource "aws_ecs_task_definition" "conversion-tool" {
      ~ arn                      = "arn:aws:ecs:us-east-1:003384571330:task-definition/qppsf-conversion-tool-td-impl:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                    command          = [
                        "/usr/src/run/qppConverter.sh",
                    ]
                  - cpu              = 0 -> null
                    environment      = []
                    essential        = true
                    image            = "003384571330.dkr.ecr.us-east-1.amazonaws.com/qppsf/conversion-tool/impl:latest"
                    logConfiguration = {
                        logDriver = "awslogs"
                        options   = {
                            awslogs-group         = "/qppsf/conversion-tool-impl"
                            awslogs-region        = "us-east-1"
                            awslogs-stream-prefix = "impl"
                        }
                    }
                    mountPoints      = []
                    name             = "conversion-tool"
                  ~ portMappings     = [
                      + {
                          + containerPort = 8443
                          + hostPort      = 8443
                          + protocol      = "tcp"
                        },
                        {
                            containerPort = 8080
                            hostPort      = 8080
                            protocol      = "tcp"
                        },
                    ]
                    secrets          = [
                        {
                            name      = "APP_ENV"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/APP_ENV"
                        },
                        {
                            name      = "AR_API_BASE_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/AR_API_BASE_URL"
                        },
                        {
                            name      = "BUCKET_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/BUCKET_NAME"
                        },
                        {
                            name      = "CPC_END_DATE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/CPC_END_DATE"
                        },
                        {
                            name      = "CPC_PLUS_BUCKET_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/CPC_PLUS_BUCKET_NAME"
                        },
                        {
                            name      = "CPC_PLUS_UNPROCESSED_FILTER_START_DATE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/CPC_PLUS_UNPROCESSED_FILTER_START_DATE"
                        },
                        {
                            name      = "CPC_PLUS_VALIDATION_FILE"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/CPC_PLUS_VALIDATION_FILE"
                        },
                        {
                            name      = "DB_APP_PASSWORD"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/DB_APP_PASSWORD"
                        },
                        {
                            name      = "DB_APP_USERNAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/DB_APP_USERNAME"
                        },
                        {
                            name      = "DB_MASTER_PASSWORD"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/DB_MASTER_PASSWORD"
                        },
                        {
                            name      = "DB_MASTER_USERNAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/DB_MASTER_USERNAME"
                        },
                        {
                            name      = "DEPLOY0A_PUBLIC-I-P"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/DEPLOY0A_PUBLIC-I-P"
                        },
                        {
                            name      = "DYNAMO_TABLE_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/DYNAMO_TABLE_NAME"
                        },
                        {
                            name      = "FMS_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/FMS_TOKEN"
                        },
                        {
                            name      = "GDIT_NESSUS_PUB_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/GDIT_NESSUS_PUB_KEY"
                        },
                        {
                            name      = "JAVA_OPTS"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/JAVA_OPTS"
                        },
                        {
                            name      = "KMS_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/KMS_KEY"
                        },
                        {
                            name      = "NEWRELIC_API_KEY"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/NEWRELIC_API_KEY"
                        },
                        {
                            name      = "NEXUS_CREDS"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/NEXUS_CREDS"
                        },
                        {
                            name      = "NEXUS_HOST"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/NEXUS_HOST"
                        },
                        {
                            name      = "ORG_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/ORG_NAME"
                        },
                        {
                            name      = "SPLUNK_TOKEN"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/SPLUNK_TOKEN"
                        },
                        {
                            name      = "VALIDATION_URL"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/VALIDATION_URL"
                        },
                        {
                            name      = "RTI_ORG_NAME"
                            valueFrom = "arn:aws:ssm:us-east-1:003384571330:parameter/qppar-sf/impl/conversion_tool/RTI_ORG_NAME"
                        },
                    ]
                    volumesFrom      = []
                } # forces replacement,
            ]
        )
        cpu                      = "2048"
        execution_role_arn       = "arn:aws:iam::003384571330:role/qppsf-ct-execution-role-impl"
        family                   = "qppsf-conversion-tool-td-impl"
      ~ id                       = "qppsf-conversion-tool-td-impl" -> (known after apply)
        memory                   = "5120"
        network_mode             = "awsvpc"
        requires_compatibilities = [
            "FARGATE",
        ]
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        task_role_arn            = "arn:aws:iam::003384571330:role/ecsTaskExecutionRole"
    }

  # module.conversion-tool.aws_lb_listener.conversion-tool-ssl will be created
  + resource "aws_lb_listener" "conversion-tool-ssl" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:003384571330:certificate/de5868ca-f22d-4ea3-b9a0-346966b27a41"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:003384571330:loadbalancer/app/qppsf-conversion-tool-lb-impl/fc5386f0e82743cb"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.conversion-tool.aws_lb_target_group.conversion-tg-ssl will be created
  + resource "aws_lb_target_group" "conversion-tg-ssl" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + deregistration_delay               = 300
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "conversion-tg-impl-ssl"
      + port                               = 8443
      + protocol                           = "HTTPS"
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Name"            = "qppsf-ct-ecr-impl"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-48f26131"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = "200-499"
          + path                = "/health"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.conversion-tool.aws_security_group.ct_app will be updated in-place
  ~ resource "aws_security_group" "ct_app" {
        arn                    = "arn:aws:ec2:us-east-1:003384571330:security-group/sg-04460af49075eec77"
        description            = "Allow inbound traffic"
        egress                 = [
            {
                cidr_blocks      = [
                    "0.0.0.0/0",
                ]
                description      = ""
                from_port        = 0
                ipv6_cidr_blocks = []
                prefix_list_ids  = []
                protocol         = "-1"
                security_groups  = []
                self             = false
                to_port          = 0
            },
        ]
        id                     = "sg-04460af49075eec77"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-013c1f26005939b02",
                ]
              - self             = false
              - to_port          = 8080
            },
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-013c1f26005939b02",
                ]
              - self             = false
              - to_port          = 8080
            },
          + {
              + cidr_blocks      = []
              + description      = ""
              + from_port        = 8443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-013c1f26005939b02",
                ]
              + self             = false
              + to_port          = 8443
            },
          + {
              + cidr_blocks      = []
              + description      = null
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = [
                  + "sg-013c1f26005939b02",
                ]
              + self             = false
              + to_port          = 8080
            },
        ]
        name                   = "conversion-tool-app-impl"
        owner_id               = "003384571330"
        revoke_rules_on_delete = false
        tags                   = {
            "Name" = "conversion-tool-app-impl"
        }
        vpc_id                 = "vpc-48f26131"
    }

  # module.conversion-tool.aws_security_group_rule.allow_https will be created
  + resource "aws_security_group_rule" "allow_https" {
      + cidr_blocks              = [
          + "10.138.168.0/21",
          + "10.232.36.0/24",
        ]
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-013c1f26005939b02"
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_security_group_rule.ct-ingress-from-https-elb-to-ui will be created
  + resource "aws_security_group_rule" "ct-ingress-from-https-elb-to-ui" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-04460af49075eec77"
      + self                     = false
      + source_security_group_id = "sg-013c1f26005939b02"
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.conversion-tool.aws_ssm_parameter.ssl_secret will be created
  + resource "aws_ssm_parameter" "ssl_secret" {
      + arn         = (known after apply)
      + description = "SSL KeyStore Password"
      + id          = (known after apply)
      + key_id      = (known after apply)
      + name        = "/qppar-sf/impl/conversion_tool/SSL_SECRET"
      + overwrite   = true
      + tags        = {
          + "Name"            = "qppsf-ct-ssm-impl"
          + "application"     = "ConversionTool"
          + "git-origin"      = "https://github.com/CMSgov/qpp-conversion-tool.git"
          + "owner"           = "qppar-final-scoring"
          + "pagerduty-email" = "qpp-final-scoring-devops@semanticbits.com"
          + "project"         = "qppsf-ct"
          + "sensitivity"     = "PII/PHI"
          + "terraform"       = "true"
        }
      + tier        = "Standard"
      + type        = "SecureString"
      + version     = (known after apply)
    }

Plan: 7 to add, 2 to change, 2 to destroy.

------------------------------------------------------------------------